julianh2o/tinkering/pic18f25k80.X/serlcd.c
#include <p18F25K80.h>
#include "serlcd.h"

char charactersSinceFill = 0;

void setupLCD(void) {
    TRISCbits.TRISC6 = 1;
    RCSTA1bits.SPEN = 1;
    TXSTA1bits.TXEN = 1;

    TXSTA1bits.SYNC = LCD_SYNC;
    BAUDCON1bits.BRG16 = LCD_BRG16;
    TXSTA1bits.BRGH = LCD_BRGH;
    
    SPBRG1 = LCD_SPBRG;
}

void sendSpecialCommand(char byte) {
    sendByte(0x7C); //control character
    sendByte(byte);
}

void sendCommand(char byte) {
    sendByte(0xFE); //control character
    sendByte(byte);
}

void setPosition(char row, char column) {
    charactersSinceFill = column*16+row;
    sendCommand(0x80 + 64*row + column);
}

void setBacklight(char brightness) {
    sendSpecialCommand(128+brightness);
}

void clear() {
    sendCommand(0x01);
}

void sendByte(char byte) {
    TXREG1 = byte;
    while(!TXSTA1bits.TRMT) Nop();
}

void sendVisibleByte(char byte) {
    charactersSinceFill++;
    sendByte(byte);
}

void sendLiteralBytes(rom const char * bytes) {
    while(*bytes) {
        sendVisibleByte(*bytes++);
    }
}

void sendDigit(unsigned char digit) {
    if (digit >= 10)
        sendVisibleByte(digit + 65);
    else
        sendVisibleByte(digit + 48);
}

void sendCharAsBase(unsigned char num, unsigned char base) {
    char quotient;
    char remainder;
    char i = 0;
    char digits[8];
    
    while(1) {
        quotient = num / base;
        remainder = num - quotient*base;
        num = quotient;

        digits[i++] = remainder;

        if (quotient == 0) break;
    }

    while (i != 0) {
        sendDigit(digits[--i]);
    }
}

void sendIntAsBase(unsigned int num, unsigned int base) {
    unsigned int quotient;
    char remainder;
    char i = 0;
    char digits[16];

    while(1) {
        quotient = num / base;
        remainder = (char)(num - quotient*base);
        num = quotient;

        digits[i++] = remainder;

        if (quotient == 0) break;
    }

    while (i != 0) {
        sendDigit(digits[--i]);
    }
}

void sendDec(unsigned char num) {
    sendCharAsBase(num,10);
}

void sendIntDec(unsigned int num) {
    sendIntAsBase(num,10);
}

void sendHex(unsigned char num) {
    sendLiteralBytes("0x");
    sendCharAsBase(num,16);
}

void sendBin(unsigned char num) {
    sendLiteralBytes("0b");
    sendCharAsBase(num,2);
}

void fill(void) {
    char i = 16*2-charactersSinceFill-1;
    //sendDec(i);
    
    while(i-- >= 0) {
        sendLiteralBytes(" ");
    }
    charactersSinceFill = 0;
}